Repository: Owczany/dart-tracker
Catalog: lib/l10n/app_*.arb
Languages: pl

source: New Game
pl: Nowa Gra

# newGameSettings
source: Game Settings
pl: Ustawienia meczu

source: History
pl: Historia

source: Dart Rules
pl: Zasady gry

source: Confirm
pl: Potwierdź

# cancel
source: Undo
pl: Cofnij

source: Save
pl: Zapisz

source: Close
pl: Zamknij

source: Yes
pl: Tak

source: No
pl: Nie

source: On
pl: Włączone

source: Off
pl: Wyłączone

source: Player
pl: Gracz

source: Players
pl: Graczy

source: Round
pl: Runda

# end_game_screen_won
source: won
pl: wygrał

# end_game_screen_saving
source: Save the game
pl: Zapisz mecz

# end_game_screen_saved
source: Game saved successfully!
pl: Mecz został zapisany!

# end_game_screen_quick_start
source: Quick rematch
pl: Szybki rewanż

# game_screen_only_3_darts
source: You have only 3 throws!
pl: Masz tylko 3 rzuty!

# game_screen_mark_3_throws
source: Mark 3 throws.
pl: Zaznacz 3 rzuty.

# game_screen_incorect_mult
source: You can't multiply 25 by 3, remove incorrect mults.
pl: Nie możesz pomnożyć 25 przez 3, usuń niepoprawne mnożniki.

# game_screen_lowerThan0_error
source: You have reached less than 0 points last turn. Some throws weren't counted.
pl: Przekroczono 0 punktów. Niektóre rzuty nie zostały zaliczone.

# game_screen_lowerThan0_error2
source: You have reached less than 0 points last turn. Last turn wasn't counted.
pl: Przekroczono 0 punktów. Runda niezaliczona.

# game_screen_doubleIn_error
source: Throws before hitting double field weren't counted.
pl: Rzuty przed trafieniem w podwójne pole nie zostały zaliczone.

# game_screen_doubleOut_error
source: The last throw wasn't in double field, so it wasn't counted.
pl: Ostatni rzut nie był w podwójne pole, więc nie został uznany.

# game_screen_doubleOut_error2
source: The last throw wasn't in double field. Last turn wasn't counted.
pl: Ostatni rzut nie był w podwójne pole. Runda niezaliczona.

# game_screen_lowerThan0_doubleOut_error
source: 2 or 3 last throws weren't counted.
pl: 2 lub 3 ostatnie rzuty nie zostały zaliczone.

# game_screen_lowerThan0_doubleOut_error2
source: Last turn wasn't counted.
pl: Runda niezaliczona.

# game_screen_one_point_error
source: You have reached exactly 1 point last turn, therefore it doesn't count.
pl: Osiągnąłeś dokładnie 1 punkt w poprzedniej rundzie, dlatego ona się nie liczy.

# game_screen_miss
source: Miss
pl: Pudło

# game_screen_throw
source: Throw
pl: Rzut

# game_screen_multiplicator
source: Multiplicator
pl: Mnożnik

# score_board_screen_scores_after_each_round
source: Score board
pl: Tabela wyników

# score_board_screen_next_player
source: Next player
pl: Następny gracz

# score_board_screen_total
source: Goal
pl: Cel

# app_bar_leaving
source: Are you sure you want to leave this match?
pl: Jesteś pewny/-a, że chcesz opuścić mecz?

# app_bar_lost_data
source: All scores will be lost.
pl: Wszystkie wyniki zostaną utracone.

source: Match History
pl: Historia meczów

# history_loading_error
source: Error loading matches
pl: Błąd podczas wczytywania meczów

# history_noone_found
source: No matches found
pl: Nie znaleziono żadnego meczu

# new_game_enter_players_names
source: Enter player names
pl: Wpisz nazwy graczy

source: Game Rules
pl: Zasady Gry

source: Settings
pl: Ustawienia

# settings_choose_language
source: Language
pl: Język

# settings_board_version
source: Board Version
pl: Wersja tarczy

# settings_touch
source: Touch
pl: Dotykowa

# settings_type
source: Type
pl: Manualna

# settings_show_numbers
source: Show field's values on the board
pl: Pokaż wartości pól na tablicy

# settings_game_mode
source: Game mode
pl: Tryb gry

# settings_easyMode
source: Easy mode
pl: Łatwy

# settings_easyMode_hint
source: To win reach 0 points or less.
pl: Żeby wygrać należy zdobyć 0 punktów lub mniej.

# settings_normalMode
source: Normal Mode
pl: Normalny

# settings_normalMode_hint
source: To win you must achieve exactly a score of 0.
pl: Żeby wygrać należy zdobyć dokładnie 0 punktów.

# settings_proMode
source: Pro mode
pl: Pro

# settings_proMode_hint
source: To win reach exactly 0 points. First and last throws must hit into double field.
pl: Żeby wygrać należy zdobyć dokładnie 0 punktów. Dodatkowo pierwszy i ostatni rzut muszą trafić w podwójne pole.

# settings_points_to_win
source: How many points do you want to play to?
pl: Do ilu punktów chcesz grać?

# settings_classic
source: Classic
pl: Klasyczny

# settings_quick
source: Quick
pl: Szybki

# settings_custom
source: Custom
pl: Niestandardowy

# settings_entering_score
source: Enter Custom Score
pl: Wpisz niestandardowy wynik

# settings_entering_hint
source: bigger than
pl: większy niż

# settings_fe
source: For example
pl: Na przykład

# settings_entering_error
source: Invalid value. Enter a number greater than
pl: Niepoprawna wartość. Wpisz liczbę większą niż

# settings_theme_dark
source: Dark
pl: Ciemny

# settings_theme_light
source: Light
pl: Jasny

# settings_choose_theme
source: Choose theme
pl: Wybierz motyw

# settings_lower_than_0
source: To win reach 0 points or less.
pl: Żeby wygrać należy zdobyć 0 punktów lub mniej.

# settings_exactly_0
source: To win reach exactly 0 points.
pl: Żeby wygrać należy zdobyć dokładnie 0 punktów.

# settings_remove_last_round
source: If the throw is Incorrect, the entire round isn't counted.
pl: Przy Niepoprawnym rzucie cała runda jest niezaliczona

# settings_remove_incorect_throws
source: If the throw is Incorrect, only this throw isn't counted.
pl: Przy Niepoprawnym rzucie, niezaliczony jest tylko ten rzut.

# rules_game_goal
source: The goal of the game is to reduce the starting number of points (501, 301 or other) to zero or lower (depending on the selected mode). When throwing at the target, the number hit is subtracted from the starting score. The game is divided into rounds, in which players take turns throwing. Each player has three throws to make on their turn.
pl: Celem gry jest zredukowanie początkowej liczby punktów (501, 301 lub innej) do zera lub niżej (zależnie od wybranego trybu). Rzucając w tarczę, trafiona wartość jest odejmowana od początkowego wyniku. Gra jest podzielona na rundy, w których gracze kolejno wykonują rzuty. Każdy gracz w swojej turze ma do wykonania trzy rzuty.

# rules_dartboard_description
source: The board has 20 sections worth 1 to 20 points (black and yellow fields). In addition to them, there are also green-red double (x2) areas - a larger circle and triple (x3) - a smaller circle. Hitting such an area multiplies the value of the given section by the hit multiplier. The very center of the shield is called the Bullseye and is worth 25 (green small circle) or 25x2 (red center). The visibility of the field values ​​can be turned on/off during the game.
pl: Tarcza ma 20 sekcji wartych od 1 do 20 punktów (czarne i żółte pola). Oprócz nich są też zielono-czerwone obszary podwójne (x2) - większy okrąg oraz potrójne (x3) - mniejszy okrąg. Trafienie takiego obszaru mnoży wartość danej sekcji przez trafiony mnożnik. Sam środek tarczy nazywa się Bullseye i jest warty 25 (zielony mały okrąg) lub 25x2 (czerwony środek). Widoczność wartości pól można włączyć/wyłączyć podczas gry.

# rules_game_modes
source: Game modes
pl: Tryby gry

# rules_easyMode_description
source: All throws count. To win you have to reduce the starting score to 0 or lower. For example, the round is won when, with 42 points, 20x3 is hit.
pl: Wszystkie rzuty się liczą. Żeby wygrać należy zredukować wynik począrtkowy do 0 lub je przekroczyć. Np. Runda jest wygrana, gdy mając 42 punkty zostało trafione 20x3.

# rules_proMode_description
source: You must score exactly 0 points. Additionally, the Double In and Double Out rules apply. If you exceed zero, or if the last throw doesn't hit a double field, the round isn't counted.
pl: Należy osiągnąć dokładnie 0 punktów. Dodatkowo obowiązują reguły Double In oraz Double Out. Przy przekroczeniu zera, lub gdy ostatni rzut nie trafił podwójnego pola, runda jest niezaliczona.

# rules_customMode_description
source: The player can choose the rules of the game himself.
pl: Gracz może sam wybrać reguły gry.

# rules_available_game_rules
source: Available game rules
pl: Dostępne reguły gry

# rules_doubleIn_description
source: Points start to be subtracted only after the first hit in a double field. Previous throws/rounds aren't counted.
pl: Punkty zaczynają się odejmować dopiero po pierwszym trafieniu w podwójne pole. Poprzednie rzuty / rundy są niezaliczone.

# rules_doubleOut_description
source: The last throw must hit a double field. When this rule is ON, a throw that could have won but didn't hit a double is called an Incorrect and a Penalty is assessed. (Miss throws are ignored.)
pl: Ostatni rzut musi trafić w podwójne pole. Przy włączeniu tej reguły rzut, który mógłby wygrać, ale nie trafił w podwójne pole jest nazywany Niepoprawnym i naliczana jest Kara. (Rzuty chybione są pomijane.)

# rules_lowerThan0_description
source: You can set whether the game ends at exactly 0 points, or else 0 or less (like in Easy mode). If the first option is ON, if a player has got 0 on his throw, that throw is considered Incorrect and a Penalty is assessed.
pl: Można ustawić, czy gra ma się kończyć poprzez osiągnięcie dokładnie 0 punktów, czy 0 lub mniej (tak jak w trybie Łatwym). Przy wybraniu pierwszej opcji jeżeli gracz przekroczył wartość 0 w swoim rzucie, rzut ten jest uznawany za Niepoprawny i naliczona jest Kara.

# rules_penalty
source: Penalty
pl: Kara

# rules_penalty_description
source: This means than last round isn't counted, or only the Incorrect throws aren't. (Depending on whitch is choosen.)
pl: Oznacza niezaliczenie całej ostatniej rundy, lub tylko Niepoprawnych rzutów. (W zależności od wybranej opcji.)
